In [1]:
import pandas as pd
import numpy as np

In [29]:
people={
    'first':['samma','soni','sageena','musarrat',np.nan,None,'NA'],
    'last':['khatoon','bibi','begam','fatma',np.nan,np.nan,'Missing'],
    'email':['sammak@gmail.com','sonib@gmail.com','sageenabegam@gmail.com',None,np.nan,'anonymous@gmail.com','NA'],
    'age':['20','30','45','19',None,None,'Missing']
    }

In [30]:
df=pd.DataFrame(people)
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [31]:
df

      first     last                   email   age
0     samma  khatoon        sammak@gmail.com    20
1      soni     bibi         sonib@gmail.com    30
2   sageena    begam  sageenabegam@gmail.com    45
3  musarrat    fatma                    None    19
4       NaN      NaN                     NaN  None
5      None      NaN     anonymous@gmail.com  None
6       NaN      NaN                     NaN   NaN

In [32]:
df.dropna()

     first     last                   email age
0    samma  khatoon        sammak@gmail.com  20
1     soni     bibi         sonib@gmail.com  30
2  sageena    begam  sageenabegam@gmail.com  45

In [33]:
df.dropna(axis='index',how='any')

     first     last                   email age
0    samma  khatoon        sammak@gmail.com  20
1     soni     bibi         sonib@gmail.com  30
2  sageena    begam  sageenabegam@gmail.com  45

In [34]:
df.dropna(axis='index',how='all')

      first     last                   email   age
0     samma  khatoon        sammak@gmail.com    20
1      soni     bibi         sonib@gmail.com    30
2   sageena    begam  sageenabegam@gmail.com    45
3  musarrat    fatma                    None    19
5      None      NaN     anonymous@gmail.com  None

In [35]:
df.dropna(axis='columns',how='all')

      first     last                   email   age
0     samma  khatoon        sammak@gmail.com    20
1      soni     bibi         sonib@gmail.com    30
2   sageena    begam  sageenabegam@gmail.com    45
3  musarrat    fatma                    None    19
4       NaN      NaN                     NaN  None
5      None      NaN     anonymous@gmail.com  None
6       NaN      NaN                     NaN   NaN

In [36]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [37]:
df.dropna(axis='index',how='any',subset=['email'])

     first     last                   email   age
0    samma  khatoon        sammak@gmail.com    20
1     soni     bibi         sonib@gmail.com    30
2  sageena    begam  sageenabegam@gmail.com    45
5     None      NaN     anonymous@gmail.com  None

In [38]:
df.dropna(axis='index',how='all',subset=['email'])

     first     last                   email   age
0    samma  khatoon        sammak@gmail.com    20
1     soni     bibi         sonib@gmail.com    30
2  sageena    begam  sageenabegam@gmail.com    45
5     None      NaN     anonymous@gmail.com  None

In [39]:
df.dropna(axis='index',how='all',subset=['last','email'])

      first     last                   email   age
0     samma  khatoon        sammak@gmail.com    20
1      soni     bibi         sonib@gmail.com    30
2   sageena    begam  sageenabegam@gmail.com    45
3  musarrat    fatma                    None    19
5      None      NaN     anonymous@gmail.com  None

In [40]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [41]:
df.fillna('MISSING')

      first     last                   email      age
0     samma  khatoon        sammak@gmail.com       20
1      soni     bibi         sonib@gmail.com       30
2   sageena    begam  sageenabegam@gmail.com       45
3  musarrat    fatma                 MISSING       19
4   MISSING  MISSING                 MISSING  MISSING
5   MISSING  MISSING     anonymous@gmail.com  MISSING
6   MISSING  MISSING                 MISSING  MISSING

In [42]:
df.fillna(0)

      first     last                   email age
0     samma  khatoon        sammak@gmail.com  20
1      soni     bibi         sonib@gmail.com  30
2   sageena    begam  sageenabegam@gmail.com  45
3  musarrat    fatma                       0  19
4         0        0                       0   0
5         0        0     anonymous@gmail.com   0
6         0        0                       0   0

In [43]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [48]:
df['age']=df['age'].astype(float)

      first     last                   email   age
0     samma  khatoon        sammak@gmail.com  20.0
1      soni     bibi         sonib@gmail.com  30.0
2   sageena    begam  sageenabegam@gmail.com  45.0
3  musarrat    fatma                    None  19.0
4       NaN      NaN                     NaN   NaN
5      None      NaN     anonymous@gmail.com   NaN
6       NaN      NaN                     NaN   NaN

In [49]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [51]:
df['age'].mean()

np.float64(28.5)